app/Http/Helper.php

select sum(`quantity`) as aggregate from `wishlists` where `user_id` = 2 and `cart_id` is null
---
  public static function wishlistCount($user_id = '')
  {

    if (Auth::check()) {
      if ($user_id == "")
        $user_id = auth()->user()->id;
      return Wishlist::where('user_id', $user_id)->where('cart_id', null)->sum('quantity');

select * from `wishlists` where `user_id` = 2 and `cart_id` is null
---
  public static function totalWishlistPrice($user_id = '')
  {
    if (Auth::check()) {
      if ($user_id == "")
        $user_id = auth()->user()->id;
      return Wishlist::where('user_id', $user_id)->where('cart_id', null)->sum('amount');