app/Http/Controllers/FrontendController.php

    public function home(){
        $featured=Product::where('status','active')->where('is_featured',1)->orderBy('id','DESC')->limit(2)->get();
        $posts=Post::where('status','active')->orderBy('id','DESC')->limit(3)->get();
        $banners=Banner::where('status','active')->limit(3)->orderBy('id','DESC')->get();
        $products=Product::where('status','active')->orderBy('id','DESC')->get();
        $product_detail=ProductsAttribute::where('status','active')->get();
        $category=Category::where('status','active')->where('is_parent',1)->orderBy('title','ASC')->get();

        return view('frontend.index')
                ->with('featured',$featured)
                ->with('posts',$posts)
                ->with('banners',$banners)
                ->with('product_lists',$products)
                ->with('category_lists',$category)
                ->with('product_detail',$product_detail);
---
select * from `posts` where `status` = 'active' order by `id` desc limit 3
select * from `banners` where `status` = 'active' order by `id` desc limit 3
select * from `categories` where `status` = 'active' and `is_parent` = 1 order by `title` asc
select * from `products` where `status` = 'active' order by `id` desc limit 8

        }


        $recent_products=Product::where('status','active')->orderBy('id','DESC')->limit(3)->get();
---
select * from `products` where `status` = 'active' order by `id` desc limit 3

    public function blogByTag(Request $request){
        // dd($request->slug);
        $post=Post::getBlogByTag($request->slug);
        // return $post;
        $rcnt_post=Post::where('status','active')->orderBy('id','ASC')->limit(3)->get();
        return view('frontend.pages.blog')->with('posts',$post)->with('recent_posts',$rcnt_post);
---
select * from `posts` where `status` = 'active' order by `id` desc limit 3
select * from `posts` where `status` = 'active' order by `id` desc limit 9 offset 0
select count(*) as aggregate from `posts` where `status` = 'active'